wrk2/dome/300KB/wrk-wlan0-rep04.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 124.675ms, rate sampling interval: 443ms
  Thread calibration: mean lat.: 125.345ms, rate sampling interval: 450ms
  Thread calibration: mean lat.: 129.168ms, rate sampling interval: 439ms
  Thread calibration: mean lat.: 123.870ms, rate sampling interval: 408ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   122.25ms   81.09ms 964.10ms   70.58%
    Req/Sec    62.70      5.49    81.00     75.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  114.05ms
 75.000%  179.97ms
 90.000%  212.74ms
 99.000%  350.72ms
 99.900%  603.65ms
 99.990%  932.35ms
 99.999%  964.61ms
100.000%  964.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.547     0.000000            1         1.00
      30.575     0.100000          503         1.11
      46.495     0.200000         1006         1.25
      66.239     0.300000         1509         1.43
      88.959     0.400000         2011         1.67
     114.047     0.500000         2515         2.00
     123.327     0.550000         2768         2.22
     134.911     0.600000         3017         2.50
     154.367     0.650000         3269         2.86
     169.727     0.700000         3520         3.33
     180.095     0.750000         3774         4.00
     184.191     0.775000         3898         4.44
     188.415     0.800000         4025         5.00
     192.255     0.825000         4148         5.71
     197.119     0.850000         4277         6.67
     203.647     0.875000         4403         8.00
     207.871     0.887500         4463         8.89
     212.735     0.900000         4526        10.00
     219.263     0.912500         4589        11.43
     227.967     0.925000         4650        13.33
     238.975     0.937500         4713        16.00
     245.119     0.943750         4745        17.78
     251.519     0.950000         4778        20.00
     256.383     0.956250         4808        22.86
     261.503     0.962500         4840        26.67
     266.751     0.968750         4870        32.00
     270.335     0.971875         4888        35.56
     275.199     0.975000         4902        40.00
     282.367     0.978125         4918        45.71
     286.975     0.981250         4933        53.33
     298.239     0.984375         4949        64.00
     311.295     0.985938         4957        71.11
     324.863     0.987500         4965        80.00
     333.311     0.989062         4973        91.43
     355.583     0.990625         4980       106.67
     368.127     0.992188         4988       128.00
     398.847     0.992969         4992       142.22
     412.671     0.993750         4996       160.00
     451.327     0.994531         5000       182.86
     490.751     0.995313         5004       213.33
     503.551     0.996094         5008       256.00
     516.607     0.996484         5010       284.44
     524.799     0.996875         5012       320.00
     544.767     0.997266         5014       365.71
     567.807     0.997656         5016       426.67
     575.999     0.998047         5018       512.00
     576.511     0.998242         5019       568.89
     588.287     0.998437         5021       640.00
     588.287     0.998633         5021       731.43
     603.647     0.998828         5022       853.33
     607.231     0.999023         5023      1024.00
     607.231     0.999121         5023      1137.78
     676.351     0.999219         5024      1280.00
     676.351     0.999316         5024      1462.86
     925.695     0.999414         5025      1706.67
     925.695     0.999512         5025      2048.00
     925.695     0.999561         5025      2275.56
     932.351     0.999609         5026      2560.00
     932.351     0.999658         5026      2925.71
     932.351     0.999707         5026      3413.33
     932.351     0.999756         5026      4096.00
     932.351     0.999780         5026      4551.11
     964.607     0.999805         5027      5120.00
     964.607     1.000000         5027          inf
#[Mean    =      122.251, StdDeviation   =       81.092]
#[Max     =      964.096, Total count    =         5027]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7626 requests in 30.03s, 2.19GB read
Requests/sec:    253.98
Transfer/sec:     74.54MB