wrk2/dome/300KB/wrk-wlan0-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 92.354ms, rate sampling interval: 312ms
  Thread calibration: mean lat.: 78.210ms, rate sampling interval: 256ms
  Thread calibration: mean lat.: 79.081ms, rate sampling interval: 220ms
  Thread calibration: mean lat.: 84.448ms, rate sampling interval: 304ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    76.65ms   72.46ms 955.39ms   89.10%
    Req/Sec    63.10     29.23   146.00     73.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   54.17ms
 75.000%   89.41ms
 90.000%  156.16ms
 99.000%  371.20ms
 99.900%  569.34ms
 99.990%  905.22ms
 99.999%  955.90ms
100.000%  955.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.095     0.000000            1         1.00
      20.015     0.100000          505         1.11
      29.983     0.200000         1009         1.25
      38.463     0.300000         1513         1.43
      45.791     0.400000         2015         1.67
      54.175     0.500000         2520         2.00
      59.647     0.550000         2771         2.22
      66.943     0.600000         3023         2.50
      74.943     0.650000         3276         2.86
      82.175     0.700000         3527         3.33
      89.407     0.750000         3778         4.00
      94.463     0.775000         3904         4.44
      99.903     0.800000         4029         5.00
     108.415     0.825000         4155         5.71
     122.175     0.850000         4281         6.67
     137.343     0.875000         4407         8.00
     146.559     0.887500         4470         8.89
     156.287     0.900000         4533        10.00
     166.015     0.912500         4597        11.43
     178.303     0.925000         4659        13.33
     226.559     0.937500         4722        16.00
     240.767     0.943750         4753        17.78
     247.423     0.950000         4785        20.00
     254.463     0.956250         4816        22.86
     260.095     0.962500         4848        26.67
     267.007     0.968750         4880        32.00
     270.591     0.971875         4896        35.56
     273.663     0.975000         4911        40.00
     277.759     0.978125         4926        45.71
     284.671     0.981250         4942        53.33
     294.399     0.984375         4958        64.00
     304.383     0.985938         4966        71.11
     324.095     0.987500         4974        80.00
     347.135     0.989062         4981        91.43
     378.367     0.990625         4989       106.67
     390.911     0.992188         4997       128.00
     393.983     0.992969         5001       142.22
     397.311     0.993750         5005       160.00
     402.943     0.994531         5009       182.86
     452.607     0.995313         5014       213.33
     461.055     0.996094         5017       256.00
     467.455     0.996484         5019       284.44
     471.039     0.996875         5021       320.00
     473.599     0.997266         5023       365.71
     487.423     0.997656         5025       426.67
     506.111     0.998047         5027       512.00
     513.535     0.998242         5028       568.89
     525.311     0.998437         5029       640.00
     556.031     0.998633         5030       731.43
     569.343     0.998828         5031       853.33
     571.903     0.999023         5032      1024.00
     571.903     0.999121         5032      1137.78
     662.527     0.999219         5033      1280.00
     662.527     0.999316         5033      1462.86
     664.063     0.999414         5034      1706.67
     664.063     0.999512         5034      2048.00
     664.063     0.999561         5034      2275.56
     905.215     0.999609         5035      2560.00
     905.215     0.999658         5035      2925.71
     905.215     0.999707         5035      3413.33
     905.215     0.999756         5035      4096.00
     905.215     0.999780         5035      4551.11
     955.903     0.999805         5036      5120.00
     955.903     1.000000         5036          inf
#[Mean    =       76.648, StdDeviation   =       72.462]
#[Max     =      955.392, Total count    =         5036]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7574 requests in 30.13s, 2.17GB read
Requests/sec:    251.40
Transfer/sec:     73.75MB